experiments/local-single-gpu-v0/results/day05/logs/bench_medium_i512_o128_c4.txt
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x72c1ea2fd440>, trust_remote_code=False, seed=0, num_prompts=16, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=512, random_output_len=128, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai-chat', base_url='http://127.0.0.1:8000', host='127.0.0.1', port=8000, endpoint='/v1/chat/completions', header=None, max_concurrency=4, model='models/Qwen/Qwen2.5-0.5B-Instruct', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir='results/day05/raw', result_filename='day05_medium_i512_o128_c4.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,95,99', goodput=None, request_id_prefix='bench-f294a7e1-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 06-16 09:10:42 [utils.py:90] Sampling input_len from [512, 512] and output_len from [128, 128]
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 4
100%|██████████| 16/16 [00:01<00:00, 13.61it/s]

                             Output tokens per second
  1800 +--------------------------------------------------------------------+
       |*                                                                   |
  1600 | **                                                                 |
       |   ***                                                              |
  1400 |      **                                                            |
       |        ***                                                         |
  1200 |           **                                                       |
       |             ***                                                    |
  1000 |                **                                                  |
       |                  ***                                               |
       |                     **                                             |
   800 |                       ***                                          |
       |                          **                                        |
   600 |                            ***                                     |
       |                               **                                   |
   400 |                                 ******                             |
       |                                       ********                     |
   200 |                                               *********            |
       |                                                        ********    |
     0 +--------------------------------------------------------------------+
       0               0.5                1               1.5               2

                         Concurrent requests per second
  16 +----------------------------------------------------------------------+
     | **                                                                   |
  14 |   ***                                                                |
     |      **                                                              |
     |        ***                                                           |
  12 |           ***                                                        |
     |              **                                                      |
  10 |                ***                                                   |
     |                   **                                                 |
   8 |                     ***                                              |
     |                        **                                            |
     |                          ***                                         |
   6 |                             ***                                      |
     |                                **                                    |
   4 |                                  *****                               |
     |                                       *******                        |
     |                                              *******                 |
   2 |                                                     *******          |
     |                                                            *******   |
   0 +----------------------------------------------------------------------+
     0                0.5                1               1.5                2
============ Serving Benchmark Result ============
Successful requests:                     16        
Failed requests:                         0         
Maximum request concurrency:             4         
Benchmark duration (s):                  1.18      
Total input tokens:                      8656      
Total generated tokens:                  2048      
Request throughput (req/s):              13.61     
Output token throughput (tok/s):         1742.67   
Peak output token throughput (tok/s):    1730.00   
Peak concurrent requests:                16.00     
Total token throughput (tok/s):          9108.15   
---------------Time to First Token----------------
Mean TTFT (ms):                          25.76     
Median TTFT (ms):                        26.63     
P50 TTFT (ms):                           26.63     
P90 TTFT (ms):                           31.40     
P95 TTFT (ms):                           31.50     
P99 TTFT (ms):                           31.66     
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          2.11      
Median TPOT (ms):                        2.09      
P50 TPOT (ms):                           2.09      
P90 TPOT (ms):                           2.15      
P95 TPOT (ms):                           2.15      
P99 TPOT (ms):                           2.17      
---------------Inter-token Latency----------------
Mean ITL (ms):                           2.09      
Median ITL (ms):                         2.09      
P50 ITL (ms):                            2.09      
P90 ITL (ms):                            2.12      
P95 ITL (ms):                            2.14      
P99 ITL (ms):                            2.30      
----------------End-to-end Latency----------------
Mean E2EL (ms):                          293.35    
Median E2EL (ms):                        292.68    
P50 E2EL (ms):                           292.68    
P90 E2EL (ms):                           296.27    
P95 E2EL (ms):                           296.37    
P99 E2EL (ms):                           296.53    
==================================================